#include	"lcd1602.h"

/**************************************
功能描述：LCD1602写命令函数 
入口参数int8 com
返回值：无
***************************************/
void lcd_wcom(uint8 com)                 
{ 
    rs=0;               //选择指令寄存器 
    rw=0;               //选择写 
    P0=com;             //把命令字送入P0 
    delay_ms(1);        //延时一小会儿，让1602准备接收数据 
    en=1;               //使能线电平变化，命令送入1602的8位数据口 
    en=0; 
} 

/**************************************
功能描述：LCD1602写数据函数 
入口参数：uint8 dat
返回值：无
***************************************/
void lcd_wdat(uint8 dat)          
{ 
    rs=1;               //选择数据寄存器 
    rw=0;               //选择写 
    P0=dat;             //把要显示的数据送入P0 
    delay_ms(1);        //延时一小会儿，让1602准备接收数据 
    en=1;               //使能线电平变化，数据送入1602的8位数据口 
    en=0; 
} 

/**************************************
功能描述：LCD1602初始化函数 
入口参数：无
返回值：无
***************************************/
void lcd_init(void)                 
{ 
    lcd_wcom(0x38);       //8位数据，双列，5*7字形       
    lcd_wcom(0x0c);       //开启显示屏，关光标，光标不闪烁 
    lcd_wcom(0x06);       //显示地址递增，即写一个数据后，显示位置右移一位 
    lcd_wcom(0x01);       //清屏 
} 		

/**************************************
功能描述：LCD1602按指定位置显示一个字符
入口参数：uint8 X, uint8 Y, uint8 DData
返回值：无
***************************************/
void DisplayOneChar(uint8 X, uint8 Y, uint8 DData)
{
	Y &= 0x1;
	X &= 0xF; //限制X不能大于15，Y不能大于1
	if (Y) X |= 0x40; //当要显示第二行时地址码+0x40;
	X |= 0x80; //算出指令码
	lcd_wcom(X); //发命令字
	lcd_wdat(DData); //发数据
}

/**************************************
功能描述：LCD1602按指定位置显示一串字符
入口参数：uint8 X, uint8 Y, uint8 DData  X代表第X+1列，Y代表第Y+1行
返回值：无
***************************************/
void DisplayListChar(uint8 X, uint8 Y, uint8 code *DData)
{
	uint8 ListLength;

  ListLength = 0;
	Y &= 0x1;
	X &= 0xF; //限制X不能大于15，Y不能大于1
	while (DData[ListLength]>0x19) //若到达字串尾则退出
		{
			if (X <= 0xF)        //X坐标应小于0xF
				{
					DisplayOneChar(X, Y, DData[ListLength]); //显示单个字符
					ListLength++;
					X++;
				}
		}
}
